<?php
/**
 * 操作日志选项
 * @author zhangyuchao
 */
return [
    'adminLog' => [
        1  => '重置用户密码操作',
        2  => '管理员添加操作',
        3  => '重置管理员密码操作',
        4  => '删除管理员操作',
        5  => '添加网站基本配置操作',
        6  => '编辑网站基本配置操作',
        7  => '添加友情链接操作',
        8  => '编辑友情链接操作',
        9  => '删除友情链接操作',
        10 => '重置用户密码',
        11 => '添加权限操作'
    ],
    'userLog' => [
        1  => '退出登录操作',
        2  => '更新个人信息操作',
        3  => '重置密码操作',
        4  => '绑定账号操作'
    ],
    'systemLog' =>[
        1  => '短信验证码发送失败',
        2  => '邮件发送失败',
        3  => '注册失败---用户注册源数据表写入失败',
        4  => '注册失败---用户信息表写入失败',
        5  => '注册失败---用户登录索引表写入失败',
        6  => '用户登录日志表写入失败',
        7  => '登录索引变更新数据失败',
        8  => '用户信息表更新失败',
        9  => '订单数据写入失败',
        10 => '订单详情表写入数据失败',
        11 => '订单入库但购物车缓存清除失败',
        12 => '订单支付功能出现bug',
        13 => '订单表:支付状态修改失败',
        14 => '订单详情表:订单状态修改失败',
        15 => '支付宝异步请求失败',
        16 => '微信生成订单二维码失败',
        17 => '轮训订单时,发现订单丢失',
        18 => '库存数量修改失败',
    ]
];